## **[Exercícios] - SQL**

In [ ]:
#importar biblioteca
import sqlite3

In [ ]:
#criando conexão e banco de dados
conexao = sqlite3.connect('banco_de_dados.sqlite')

1. Crie uma tabela chamada "alunos" com os seguintes campos: id (inteiro), nome (texto), idade (inteiro) e curso (texto)

In [ ]:
cursor = conexao.cursor()
cursor.execute('''
    CREATE TABLE alunos (
      id INT,
      nome VARCHAR(100),
      idade INT,
      curso VARCHAR(100))
''')
conexao.commit()

2. Insira pelo menos 5 registros de alunos na tabela que você criou no exercício anterior.

In [ ]:
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (1, "João Silva", 20, "Ciência da Computação")')

In [ ]:
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (2, "Maria Santos", 22, "Engenharia Elétrica")')

In [ ]:
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (3, "Carlos Oliveira", 19, "Administração")')

In [ ]:
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (4, "Ana Souza", 21, "Medicina")')

In [ ]:
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (5, "Pedro Ferreira", 23, "Direito")')

In [ ]:
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (6, "Julia Lima", 18, "Física")')

In [ ]:
cursor.execute('INSERT INTO alunos (id, nome, idade, curso) VALUES (7, "Lucas Pereira", 24, "Engenharia Biomédica")')

3. Consultas Básicas Escreva consultas SQL para realizar as seguintes tarefas:

a) Selecionar todos os registros da tabela "alunos":

In [ ]:
cursor.execute("SELECT * FROM alunos")
alunos = cursor.fetchall()
for aluno in alunos:
    print(aluno)

(1, 'João Silva', 20, 'Ciência da Computação')
(2, 'Maria Santos', 22, 'Engenharia Elétrica')
(3, 'Carlos Oliveira', 19, 'Administração')
(4, 'Ana Souza', 21, 'Medicina')
(5, 'Pedro Ferreira', 23, 'Direito')
(6, 'Julia Lima', 18, 'Física')
(7, 'Lucas Pereira', 24, 'Engenharia Biomédica')

b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

In [ ]:
cursor.execute('SELECT nome, idade FROM alunos WHERE idade > 20')
alunos = cursor.fetchall()
for aluno in alunos:
    print(aluno)

('Maria Santos', 22)
('Ana Souza', 21)
('Pedro Ferreira', 23)
('Lucas Pereira', 24)

c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética

In [ ]:
cursor.execute('SELECT nome, curso FROM alunos WHERE curso LIKE "Engenharia%" ORDER BY nome ASC')
alunos = cursor.fetchall()
for aluno in alunos:
    print(aluno)

('Lucas Pereira', 'Engenharia Biomédica')
('Maria Santos', 'Engenharia Elétrica')

d) Contar o número total de alunos na tabela

In [ ]:
cursor.execute('SELECT COUNT(*) AS total_alunos FROM alunos')
alunos = cursor.fetchall()
for aluno in alunos:
    print(aluno)

(7,)

4. Atualização e Remoção

a) Atualize a idade de um aluno específico na tabela.

In [ ]:
cursor.execute('UPDATE alunos SET idade=30 WHERE nome="João Silva"')
alunos = cursor.fetchall()
for aluno in alunos:
    print(aluno)

In [ ]:
cursor.execute("SELECT * FROM alunos")
alunos = cursor.fetchall()
for aluno in alunos:
    print(aluno)

(1, 'João Silva', 30, 'Ciência da Computação')
(2, 'Maria Santos', 22, 'Engenharia Elétrica')
(3, 'Carlos Oliveira', 19, 'Administração')
(4, 'Ana Souza', 21, 'Medicina')
(5, 'Pedro Ferreira', 23, 'Direito')
(6, 'Julia Lima', 18, 'Física')
(7, 'Lucas Pereira', 24, 'Engenharia Biomédica')

b) Remova um aluno pelo seu ID

In [ ]:
cursor.execute('DELETE FROM alunos WHERE id=2')
alunos = cursor.fetchall()
for aluno in alunos:
    print(aluno)

In [ ]:
cursor.execute("SELECT * FROM alunos")
alunos = cursor.fetchall()
for aluno in alunos:
    print(aluno)

(1, 'João Silva', 30, 'Ciência da Computação')
(3, 'Carlos Oliveira', 19, 'Administração')
(4, 'Ana Souza', 21, 'Medicina')
(5, 'Pedro Ferreira', 23, 'Direito')
(6, 'Julia Lima', 18, 'Física')
(7, 'Lucas Pereira', 24, 'Engenharia Biomédica')

In [ ]:
conexao.close()

5. Criar uma Tabela e Inserir Dados

Crie uma tabela chamada "clientes" com os campos: id (chave primária), nome (texto), idade (inteiro) e saldo (float). Insira alguns registros de clientes na tabela.

In [ ]:
#criando nova conexão e banco de dados
conexao01 = sqlite3.connect('banco_dados.sqlite')

Criei uma nova conexão e um novo banco de dados para não me confundir. Mas depois percebi que não era necessário.

In [ ]:
#criando tabela
cursor = conexao01.cursor()
cursor.execute('''
    CREATE TABLE clientes (
      id INT PRIMARY KEY,
      nome VARCHAR(100),
      idade INT,
      saldo REAL)
''')
conexao01.commit()

In [ ]:
#inserindo registros
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (1, "João Silva", 35, 1000.50)')

In [ ]:
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (2, "Maria da Silva", 40, 1000)')

In [ ]:
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (3, "Carlos Souza", 30, 500)')

In [ ]:
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (4, "Ana Santos", 25, 2000.60)')

In [ ]:
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (5, "Pedro Oliveira", 45, 1500)')

In [ ]:
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (6, "Julia Lima", 28, 3050)')

In [ ]:
cursor.execute('INSERT INTO clientes (id, nome, idade, saldo) VALUES (7, "Lucas Pereira", 32, 2500.70)')

In [ ]:
cursor.execute("SELECT * FROM clientes")
clientes = cursor.fetchall()
for cliente in clientes:
    print(cliente)

(1, 'João Silva', 35, 1000.5)
(2, 'Maria da Silva', 40, 1000.0)
(3, 'Carlos Souza', 30, 500.0)
(4, 'Ana Santos', 25, 2000.6)
(5, 'Pedro Oliveira', 45, 1500.0)
(6, 'Julia Lima', 28, 3050.0)
(7, 'Lucas Pereira', 32, 2500.7)

6. Consultas e agregações

a) Selecione o nome e a idade dos clientes com idade superior a 30 anos.

In [ ]:
cursor.execute("SELECT nome, idade FROM clientes WHERE idade > 30")
clientes = cursor.fetchall()
for cliente in clientes:
    print(cliente)

('João Silva', 35)
('Maria da Silva', 40)
('Pedro Oliveira', 45)
('Lucas Pereira', 32)

b) Calcule o saldo médio dos clientes.

In [ ]:
cursor.execute("SELECT ROUND(AVG(saldo), 2) FROM clientes")
clientes = cursor.fetchall()
for cliente in clientes:
    print(cliente)

(1650.26,)

c) Encontre o cliente com o saldo máximo.

In [ ]:
cursor.execute("SELECT nome, saldo FROM clientes WHERE saldo = (SELECT MAX(saldo) FROM clientes)")
clientes = cursor.fetchall()
for cliente in clientes:
    print(cliente)

('Julia Lima', 3050.0)

d) Conte quantos clientes têm saldo acima de 1000.

In [ ]:
cursor.execute("SELECT COUNT(*) FROM clientes WHERE saldo > 1000")
clientes = cursor.fetchall()
for cliente in clientes:
    print(cliente)

(5,)

7. Atualização e Remoção com Condições

a) Atualize o saldo de um cliente específico.

In [ ]:
cursor.execute('UPDATE clientes SET saldo=100 WHERE nome="Maria da Silva"')
clientes = cursor.fetchall()
for cliente in clientes:
    print(cliente)

In [ ]:
#exibindo a tabela com as alterações
cursor.execute("SELECT * FROM clientes")
clientes = cursor.fetchall()
for cliente in clientes:
    print(cliente)

(1, 'João Silva', 35, 1000.5)
(2, 'Maria da Silva', 40, 100.0)
(3, 'Carlos Souza', 30, 500.0)
(4, 'Ana Santos', 25, 2000.6)
(5, 'Pedro Oliveira', 45, 1500.0)
(6, 'Julia Lima', 28, 3050.0)
(7, 'Lucas Pereira', 32, 2500.7)

b) Remova um cliente pelo seu ID

In [ ]:
cursor.execute('DELETE FROM clientes WHERE id=3')
clientes = cursor.fetchall()
for cliente in clientes:
    print(cliente)

In [ ]:
#exibindo a tabela com as alterações
cursor.execute("SELECT * FROM clientes")
clientes = cursor.fetchall()
for cliente in clientes:
    print(cliente)

(1, 'João Silva', 35, 1000.5)
(2, 'Maria da Silva', 40, 100.0)
(4, 'Ana Santos', 25, 2000.6)
(5, 'Pedro Oliveira', 45, 1500.0)
(6, 'Julia Lima', 28, 3050.0)
(7, 'Lucas Pereira', 32, 2500.7)

8. Junção de Tabelas

a. Crie uma segunda tabela chamada "compras" com os campos: id (chave primária), cliente_id (chave estrangeira referenciando o id da tabela "clientes"), produto (texto) e valor (real).

In [ ]:
#criando tabela
cursor = conexao01.cursor()
cursor.execute('''
    CREATE TABLE compras (
      id INT PRIMARY KEY,
      cliente_id INT FORENGIN KEY REFERENCES clientes(id),
      produto VARCHAR(100),
      valor REAL)
''')
conexao01.commit()

b. Insira algumas compras associadas a clientes existentes na tabela "clientes". Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.

In [ ]:
# Inserindo uma compra para os clientes da tabela "clientes" na tabela 'compras'
cursor.execute("INSERT INTO compras (id, cliente_id, produto, valor) VALUES (1, 1, 'Smartphone', 2500.0)")

In [ ]:
cursor.execute("INSERT INTO compras (id, cliente_id, produto, valor) VALUES (2, 3, 'TV', 1500.0)")

In [ ]:
cursor.execute("INSERT INTO compras (id, cliente_id, produto, valor) VALUES (3, 2, 'Livro', 50.0)")

In [ ]:
cursor.execute("INSERT INTO compras (id, cliente_id, produto, valor) VALUES (4, 4, 'Roupas', 300.0)")

In [ ]:
cursor.execute("INSERT INTO compras (id, cliente_id, produto, valor) VALUES (5, 5, 'Eletrônicos', 1000.0)")

In [ ]:
cursor.execute("INSERT INTO compras (id, cliente_id, produto, valor) VALUES (6, 7, 'Brinquedos', 200.0)")

In [ ]:
cursor.execute("INSERT INTO compras (id, cliente_id, produto, valor) VALUES (7, 6, 'Alimentos', 50.0)")

In [ ]:
#imprimindo tabela
cursor.execute("SELECT * FROM compras")
compras = cursor.fetchall()
for compra in compras:
    print(compra)

(1, 1, 'Smartphone', 2500.0)
(2, 3, 'TV', 1500.0)
(3, 2, 'Livro', 50.0)
(4, 4, 'Roupas', 300.0)
(5, 5, 'Eletrônicos', 1000.0)
(6, 7, 'Brinquedos', 200.0)
(7, 6, 'Alimentos', 50.0)

In [ ]:
# exibir o nome do cliente, o produto e o valor de cada compra
cursor.execute('''
          SELECT clientes.nome, compras.produto, compras.valor
          FROM clientes INNER JOIN compras ON clientes.id = compras.cliente_id
''')
resultado = cursor.fetchall()
for linha in resultado:
    print(linha)

('João Silva', 'Smartphone', 2500.0)
('Maria da Silva', 'Livro', 50.0)
('Ana Santos', 'Roupas', 300.0)
('Pedro Oliveira', 'Eletrônicos', 1000.0)
('Lucas Pereira', 'Brinquedos', 200.0)
('Julia Lima', 'Alimentos', 50.0)

In [ ]:
conexao01.commit()
conexao01.close()